In [46]:
import pandas as pd

In [47]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [48]:
# dsiplay the first 3 rows
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [49]:
# display the last 3 rows
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [50]:
# find the shape of our dataset (rows, columns)
df.shape

(7, 3)

In [51]:
print("Rows {}:".format(df.shape[0]))
print("Columns {}:".format(df.shape[1]))

Rows 7:
Columns 3:

In [52]:
# Get information about our dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [53]:
# Check null values
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [54]:
# get overall statistics about datasets
df.describe(include='all') # since marks is the only numerical column, we can fix that with the 'include' parameter

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [55]:
# get unqie value from the 'Gender' column
df['Gender'].unique() # Male, Female

array(['Male', 'Female'], dtype=object)

In [56]:
# get the number of unique value from the 'Gender' column
print(len(df['Gender'].unique())) # 1
print(df['Gender'].nunique()) # 2

2
2

In [57]:
# Display count of unique values
df["Gender"].value_counts() # returns a pd series

Female    4
Male      3
Name: Gender, dtype: int64

In [58]:
# Find the total number of students having marks between 90 and 100
len(df[(df["Marks"] >= 90) & (df["Marks"] <= 100)])

4

In [59]:
df["Marks"].between(90, 100).sum() #Using the between method

4

In [60]:
# finding the average marks
df["Marks"].mean()

92.14285714285714

In [65]:
# Applying custom functions
def percentage(x):
    return str(x / 100) + "%"

pd.DataFrame(df["Marks"].apply(percentage))

   Marks
0  0.98%
1  0.89%
2  0.99%
3  0.87%
4   0.9%
5  0.83%
6  0.99%

In [67]:
# add this new column to our main dataframe
df["Percentage"] = df["Marks"].apply(percentage)
df

      Name  Marks  Gender Percentage
0  Priyang     98    Male      0.98%
1   Aadhya     89  Female      0.89%
2   Krisha     99  Female      0.99%
3   Vedant     87    Male      0.87%
4   Parshv     90    Male       0.9%
5   Mittal     83  Female      0.83%
6  Archana     99  Female      0.99%

In [85]:
# using lambda expression
df['Half_marks'] = df["Marks"].apply(lambda x: x // 2)
df

      Name  Marks  Gender Percentage  Half_marks
0  Priyang     98    Male      0.98%          49
1   Aadhya     89  Female      0.89%          44
2   Krisha     99  Female      0.99%          49
3   Vedant     87    Male      0.87%          43
4   Parshv     90    Male       0.9%          45
5   Mittal     83  Female      0.83%          41
6  Archana     99  Female      0.99%          49

In [93]:
df

      Name  Marks  Gender Percentage  Half_marks
0  Priyang     98    Male      0.98%          49
1   Aadhya     89  Female      0.89%          44
2   Krisha     99  Female      0.99%          49
3   Vedant     87    Male      0.87%          43
4   Parshv     90    Male       0.9%          45
5   Mittal     83  Female      0.83%          41
6  Archana     99  Female      0.99%          49

In [94]:
# Female 0 Male 1
df["Gender"].map(lambda x: 0 if x == "Female" else 1)

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [96]:
# add it to our df
df["Males_Females"] = df["Gender"].map(lambda x: 0 if x == "Female" else 1)
df

      Name  Marks  Gender Percentage  Half_marks  Males_Females
0  Priyang     98    Male      0.98%          49              1
1   Aadhya     89  Female      0.89%          44              0
2   Krisha     99  Female      0.99%          49              0
3   Vedant     87    Male      0.87%          43              1
4   Parshv     90    Male       0.9%          45              1
5   Mittal     83  Female      0.83%          41              0
6  Archana     99  Female      0.99%          49              0

In [97]:
# Just checking some datatypes
df.dtypes

Name             object
Marks             int64
Gender           object
Percentage       object
Half_marks        int64
Males_Females     int64
dtype: object

In [101]:
# drop columns
df.drop("Males_Females", axis=1, inplace=True)

In [103]:
df.drop("Half_marks", axis=1, inplace=True)

In [113]:
df.drop("Percentage", axis=1, inplace=True)

In [114]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [115]:
# print names of columns
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [116]:
# sort the dataframe as per the marks columns
df.sort_values(by=["Marks"])

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female